{
  "metadata": {
    "surah_number": 59,
    "scraped_at": "2025-10-30T05:14:31.065122",
    "source": "api.quran.com",
    "version": "1.0",
    "translation_ids": [
      213,
      20
    ]
  },
  "license": {
    "text": {
      "source": "api.quran.com",
      "license": "Public Domain",
      "attribution": "The Quran text is in the public domain",
      "terms_url": "https://quran.com/terms",
      "fetched_at": "2025-10-30T05:14:31.065122"
    },
    "translations": {
      "source": "api.quran.com",
      "license": "Various - See individual translation licenses",
      "attribution": "Translation copyrights belong to respective translators",
      "terms_url": "https://quran.com/terms",
      "fetched_at": "2025-10-30T05:14:31.065122"
    },
    "audio": {
      "source": "everyayah.com via api.quran.com",
      "license": "Free for non-commercial use",
      "attribution": "Audio recitations courtesy of everyayah.com",
      "terms_url": "https://everyayah.com/",
      "note": "Audio URLs provided - not downloaded locally due to size",
      "fetched_at": "2025-10-30T05:14:31.065122"
    }
  },
  "translation_metadata": {
    "213": {
      "name": "Abdul Hafeez & Mohammed Abdul Haq",
      "author": "Abdul Hafeez, Mohammed Abdul Haq",
      "language": "te",
      "language_name": "Telugu",
      "license": "Various",
      "source": "api.quran.com"
    },
    "20": {
      "name": "Saheeh International",
      "author": "Saheeh International",
      "language": "en",
      "language_name": "English",
      "license": "Public Domain",
      "source": "api.quran.com"
    }
  },
  "surah_info": {
    "id": 59,
    "revelation_place": "madinah",
    "revelation_order": 101,
    "bismillah_pre": true,
    "name_simple": "Al-Hashr",
    "name_complex": "Al-Ĥashr",
    "name_arabic": "الحشر",
    "verses_count": 24,
    "pages": [
      545,
      548
    ],
    "translated_name": {
      "language_name": "english",
      "name": "The Exile"
    }
  },
  "verses": [
    {
      "id": 5127,
      "verse_number": 1,
      "verse_key": "59:1",
      "hizb_number": 55,
      "rub_el_hizb_number": 218,
      "ruku_number": 481,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": " سَبَّحَ لِلَّهِ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۖ وَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
      "text_imlaei": "سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "page_number": 545,
      "juz_number": 28,
      "translations": [
        {
          "id": 100799,
          "resource_id": 20,
          "text": "Whatever is in the heavens and whatever is on the earth exalts Allāh,<sup foot_note=197521>1</sup> and He is the Exalted in Might, the Wise."
        },
        {
          "id": 1171723,
          "resource_id": 213,
          "text": "আসমানসমূহ ও যমীনে যা কিছু আছে সবই আল্লাহর পবিত্রতা ও মহিমা ঘোষণা করে; আর তিনি পরাক্রমশালী, প্ৰজ্ঞাময়।"
        }
      ]
    },
    {
      "id": 5128,
      "verse_number": 2,
      "verse_key": "59:2",
      "hizb_number": 55,
      "rub_el_hizb_number": 218,
      "ruku_number": 481,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "هُوَ ٱلَّذِىٓ أَخْرَجَ ٱلَّذِينَ كَفَرُوا۟ مِنْ أَهْلِ ٱلْكِتَـٰبِ مِن دِيَـٰرِهِمْ لِأَوَّلِ ٱلْحَشْرِ ۚ مَا ظَنَنتُمْ أَن يَخْرُجُوا۟ ۖ وَظَنُّوٓا۟ أَنَّهُم مَّانِعَتُهُمْ حُصُونُهُم مِّنَ ٱللَّهِ فَأَتَىٰهُمُ ٱللَّهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوا۟ ۖ وَقَذَفَ فِى قُلُوبِهِمُ ٱلرُّعْبَ ۚ يُخْرِبُونَ بُيُوتَهُم بِأَيْدِيهِمْ وَأَيْدِى ٱلْمُؤْمِنِينَ فَٱعْتَبِرُوا۟ يَـٰٓأُو۟لِى ٱلْأَبْصَـٰرِ",
      "text_imlaei": "هُوَ الَّذِي أَخْرَجَ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ مِن دِيَارِهِمْ لِأَوَّلِ الْحَشْرِ ۚ مَا ظَنَنتُمْ أَن يَخْرُجُوا ۖ وَظَنُّوا أَنَّهُم مَّانِعَتُهُمْ حُصُونُهُم مِّنَ اللَّهِ فَأَتَاهُمُ اللَّهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوا ۖ وَقَذَفَ فِي قُلُوبِهِمُ الرُّعْبَ ۚ يُخْرِبُونَ بُيُوتَهُم بِأَيْدِيهِمْ وَأَيْدِي الْمُؤْمِنِينَ فَاعْتَبِرُوا يَا أُولِي الْأَبْصَارِ",
      "page_number": 545,
      "juz_number": 28,
      "translations": [
        {
          "id": 100811,
          "resource_id": 20,
          "text": "It is He who expelled the ones who disbelieved among the People of the Scripture<sup foot_note=197523>1</sup> from their homes at the first gathering.<sup foot_note=197522>2</sup> You did not think they would leave, and they thought that their fortresses would protect them from Allāh; but [the decree of] Allāh came upon them from where they had not expected, and He cast terror into their hearts [so] they destroyed their houses by their [own] hands and the hands of the believers. So take warning, O people of vision."
        },
        {
          "id": 1171724,
          "resource_id": 213,
          "text": "কিতাবীদের মধ্যে যারা কুফারী করেছিল তিনিই তাদেরকে প্ৰথম সমাবেশের জন্য তাদের আবাসভূমি থেকে বিতাড়িত করেছিলেন [১]। তোমরা কল্পনাও করনি যে, তারা বেরিয়ে যাবে। আর তারা মনে করেছিল যে, তাদের দুর্গগুলো তাদের রক্ষা করবে আল্লাহর পাকড়াও থেকে; কিন্তু আল্লাহ তাদের কাছে এমনভাবে আসলেন যা তারা কল্পনাও করেনি। আর তিনি তাদের অন্তরে ত্রাসের সঞ্চার করলেন। ফলে তারা ধ্বংস করে ফেলল নিজেদের বাড়ি-ঘর নিজেদের হাতে এবং মুমিনদের হাতেও [২]; অতএব হে চক্ষুষ্মান ব্যক্তিগণ! তোমরা উপদেশ গ্রহণ কর।"
        }
      ]
    },
    {
      "id": 5129,
      "verse_number": 3,
      "verse_key": "59:3",
      "hizb_number": 55,
      "rub_el_hizb_number": 218,
      "ruku_number": 481,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "وَلَوْلَآ أَن كَتَبَ ٱللَّهُ عَلَيْهِمُ ٱلْجَلَآءَ لَعَذَّبَهُمْ فِى ٱلدُّنْيَا ۖ وَلَهُمْ فِى ٱلْـَٔاخِرَةِ عَذَابُ ٱلنَّارِ",
      "text_imlaei": "وَلَوْلَا أَن كَتَبَ اللَّهُ عَلَيْهِمُ الْجَلَاءَ لَعَذَّبَهُمْ فِي الدُّنْيَا ۖ وَلَهُمْ فِي الْآخِرَةِ عَذَابُ النَّارِ",
      "page_number": 545,
      "juz_number": 28,
      "translations": [
        {
          "id": 100818,
          "resource_id": 20,
          "text": "And if not that Allāh had decreed for them evacuation, He would have punished them in [this] world, and for them in the Hereafter is the punishment of the Fire."
        },
        {
          "id": 1171725,
          "resource_id": 213,
          "text": "আর আল্লাহ তাদের নির্বাসনদণ্ড লিপিবদ্ধ না করলেও তিনি তাদেরকে দুনিয়াতে (অন্য) শাস্তি দিতেন [১]; আর আখেরাত তাদের জন্য রয়েছে আগুনের শাস্তি।"
        }
      ]
    },
    {
      "id": 5130,
      "verse_number": 4,
      "verse_key": "59:4",
      "hizb_number": 55,
      "rub_el_hizb_number": 218,
      "ruku_number": 481,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "ذَٰلِكَ بِأَنَّهُمْ شَآقُّوا۟ ٱللَّهَ وَرَسُولَهُۥ ۖ وَمَن يُشَآقِّ ٱللَّهَ فَإِنَّ ٱللَّهَ شَدِيدُ ٱلْعِقَابِ",
      "text_imlaei": "ذَٰلِكَ بِأَنَّهُمْ شَاقُّوا اللَّهَ وَرَسُولَهُ ۖ وَمَن يُشَاقِّ اللَّهَ فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ",
      "page_number": 546,
      "juz_number": 28,
      "translations": [
        {
          "id": 100820,
          "resource_id": 20,
          "text": "That is because they opposed Allāh and His Messenger. And whoever opposes Allāh - then indeed, Allāh is severe in penalty."
        },
        {
          "id": 1171726,
          "resource_id": 213,
          "text": "এটা এ জন্যে যে, নিশ্চয় তারা আল্লাহ ও তাঁর রাসূলের বিরুদ্ধাচরণ করেছিল। আর কেউ আল্লাহর বিরুদ্ধাচরণ করলে আল্লাহ তো শাস্তি দানে কঠোর।"
        }
      ]
    },
    {
      "id": 5131,
      "verse_number": 5,
      "verse_key": "59:5",
      "hizb_number": 55,
      "rub_el_hizb_number": 218,
      "ruku_number": 481,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "مَا قَطَعْتُم مِّن لِّينَةٍ أَوْ تَرَكْتُمُوهَا قَآئِمَةً عَلَىٰٓ أُصُولِهَا فَبِإِذْنِ ٱللَّهِ وَلِيُخْزِىَ ٱلْفَـٰسِقِينَ",
      "text_imlaei": "مَا قَطَعْتُم مِّن لِّينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَىٰ أُصُولِهَا فَبِإِذْنِ اللَّهِ وَلِيُخْزِيَ الْفَاسِقِينَ",
      "page_number": 546,
      "juz_number": 28,
      "translations": [
        {
          "id": 100822,
          "resource_id": 20,
          "text": "Whatever you have cut down of [their] palm trees or left standing on their trunks - it was by permission of Allāh and so He would disgrace the defiantly disobedient."
        },
        {
          "id": 1171727,
          "resource_id": 213,
          "text": "তোমরা যে খেজুর গাছগুলো কেটেছ এবং যেগুলোকে কাণ্ডের উপর স্থিত রেখে দিয়েছ, তা তো আল্লাহ্‌রই অনুমতিক্রমে [১] এবং এ জন্যে যে, আল্লাহ ফাসিকদেরকে লাঞ্ছিত করবেন।"
        }
      ]
    },
    {
      "id": 5132,
      "verse_number": 6,
      "verse_key": "59:6",
      "hizb_number": 55,
      "rub_el_hizb_number": 218,
      "ruku_number": 481,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "وَمَآ أَفَآءَ ٱللَّهُ عَلَىٰ رَسُولِهِۦ مِنْهُمْ فَمَآ أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلَا رِكَابٍ وَلَـٰكِنَّ ٱللَّهَ يُسَلِّطُ رُسُلَهُۥ عَلَىٰ مَن يَشَآءُ ۚ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
      "text_imlaei": "وَمَا أَفَاءَ اللَّهُ عَلَىٰ رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلَا رِكَابٍ وَلَٰكِنَّ اللَّهَ يُسَلِّطُ رُسُلَهُ عَلَىٰ مَن يَشَاءُ ۚ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "page_number": 546,
      "juz_number": 28,
      "translations": [
        {
          "id": 100824,
          "resource_id": 20,
          "text": "And what Allāh restored [of property] to His Messenger from them - you did not spur for it [in an expedition] any horses or camels,<sup foot_note=197524>1</sup> but Allāh gives His messengers power over whom He wills, and Allāh is over all things competent."
        },
        {
          "id": 1171728,
          "resource_id": 213,
          "text": "আর আল্লাহ ইয়াহুদীদের কাছ থেকে তাঁর রাসূলকে যে “ফায়” দিয়েছেন, তার জন্য তোমরা ঘোড়ায় কিংবা উটে আরোহণ করে যুদ্ধ করনি [১]; বরং আল্লাহ যার উপর ইচ্ছে তাঁর রাসূলগণকে কর্তৃত্ব দান করেন; আর আল্লাহ সবকিছুর উপর ক্ষমতাবান।"
        }
      ]
    },
    {
      "id": 5133,
      "verse_number": 7,
      "verse_key": "59:7",
      "hizb_number": 55,
      "rub_el_hizb_number": 218,
      "ruku_number": 481,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "مَّآ أَفَآءَ ٱللَّهُ عَلَىٰ رَسُولِهِۦ مِنْ أَهْلِ ٱلْقُرَىٰ فَلِلَّهِ وَلِلرَّسُولِ وَلِذِى ٱلْقُرْبَىٰ وَٱلْيَتَـٰمَىٰ وَٱلْمَسَـٰكِينِ وَٱبْنِ ٱلسَّبِيلِ كَىْ لَا يَكُونَ دُولَةًۢ بَيْنَ ٱلْأَغْنِيَآءِ مِنكُمْ ۚ وَمَآ ءَاتَىٰكُمُ ٱلرَّسُولُ فَخُذُوهُ وَمَا نَهَىٰكُمْ عَنْهُ فَٱنتَهُوا۟ ۚ وَٱتَّقُوا۟ ٱللَّهَ ۖ إِنَّ ٱللَّهَ شَدِيدُ ٱلْعِقَابِ",
      "text_imlaei": "مَّا أَفَاءَ اللَّهُ عَلَىٰ رَسُولِهِ مِنْ أَهْلِ الْقُرَىٰ فَلِلَّهِ وَلِلرَّسُولِ وَلِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ كَيْ لَا يَكُونَ دُولَةً بَيْنَ الْأَغْنِيَاءِ مِنكُمْ ۚ وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانتَهُوا ۚ وَاتَّقُوا اللَّهَ ۖ إِنَّ اللَّهَ شَدِيدُ الْعِقَابِ",
      "page_number": 546,
      "juz_number": 28,
      "translations": [
        {
          "id": 100826,
          "resource_id": 20,
          "text": "And what Allāh restored to His Messenger from the people of the towns - it is for Allāh and for the Messenger and for [his] near relatives<sup foot_note=197526>1</sup> and orphans and the needy and the [stranded] traveler<sup foot_note=197525>2</sup> - so that it will not be a perpetual distribution among the rich from among you. And whatever the Messenger has given you - take; and what he has forbidden you - refrain from. And fear Allāh; indeed, Allāh is severe in penalty."
        },
        {
          "id": 1171729,
          "resource_id": 213,
          "text": "আল্লাহ্‌ জনপদবাসীদের কাছ থেকে তাঁর রাসূলকে 'ফায়’ হিসেবে যা কিছু দিয়েছেন তা আল্লাহ্‌র, রাসূলের,  রাসূলের স্বজনদের, ইয়াতীমদের,  মিসকীন ও পথচারীদের [১], যাতে তোমাদের মধ্যে যারা বিত্তবান শুধু তাদের মধ্যেই ঐশ্বর্য আবর্তন না করে। রাসূল তোমাদেরকে যা দেয় তা তোমারা গ্রহণ কর এবং যা থেকে তোমাদেরকে নিষেধ কর তা থেকে বিরত থাক [২] এবং তোমরা আল্লাহর তাকওয়া অবলম্বন কর; নিশ্চয় আল্লাহ্‌ শাস্তি দানে কঠোর।"
        }
      ]
    },
    {
      "id": 5134,
      "verse_number": 8,
      "verse_key": "59:8",
      "hizb_number": 55,
      "rub_el_hizb_number": 218,
      "ruku_number": 481,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "لِلْفُقَرَآءِ ٱلْمُهَـٰجِرِينَ ٱلَّذِينَ أُخْرِجُوا۟ مِن دِيَـٰرِهِمْ وَأَمْوَٰلِهِمْ يَبْتَغُونَ فَضْلًا مِّنَ ٱللَّهِ وَرِضْوَٰنًا وَيَنصُرُونَ ٱللَّهَ وَرَسُولَهُۥٓ ۚ أُو۟لَـٰٓئِكَ هُمُ ٱلصَّـٰدِقُونَ",
      "text_imlaei": "لِلْفُقَرَاءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُوا مِن دِيَارِهِمْ وَأَمْوَالِهِمْ يَبْتَغُونَ فَضْلًا مِّنَ اللَّهِ وَرِضْوَانًا وَيَنصُرُونَ اللَّهَ وَرَسُولَهُ ۚ أُولَٰئِكَ هُمُ الصَّادِقُونَ",
      "page_number": 546,
      "juz_number": 28,
      "translations": [
        {
          "id": 100828,
          "resource_id": 20,
          "text": "For the poor emigrants who were expelled from their homes and their properties, seeking bounty from Allāh and [His] approval and supporting [the cause of] Allāh and His Messenger, [there is also a share]. Those are the truthful."
        },
        {
          "id": 1171730,
          "resource_id": 213,
          "text": "এ সম্পদ নিঃস্ব মুহাজিরদের জন্য যারা নিজেদের বাড়িঘর ও সম্পত্তি হতে উৎখাত হয়েছে। তারা আল্লাহর অনুগ্রহ ও সস্তুষ্টির অন্বেষণ করে এবং  আল্লাহ্ ও তাঁর রাসূলের সাহায্য করে। এরাই তো সত্যাশ্রয়ী [১]।"
        }
      ]
    },
    {
      "id": 5135,
      "verse_number": 9,
      "verse_key": "59:9",
      "hizb_number": 55,
      "rub_el_hizb_number": 218,
      "ruku_number": 481,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "وَٱلَّذِينَ تَبَوَّءُو ٱلدَّارَ وَٱلْإِيمَـٰنَ مِن قَبْلِهِمْ يُحِبُّونَ مَنْ هَاجَرَ إِلَيْهِمْ وَلَا يَجِدُونَ فِى صُدُورِهِمْ حَاجَةً مِّمَّآ أُوتُوا۟ وَيُؤْثِرُونَ عَلَىٰٓ أَنفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ ۚ وَمَن يُوقَ شُحَّ نَفْسِهِۦ فَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ",
      "text_imlaei": "وَالَّذِينَ تَبَوَّءُوا الدَّارَ وَالْإِيمَانَ مِن قَبْلِهِمْ يُحِبُّونَ مَنْ هَاجَرَ إِلَيْهِمْ وَلَا يَجِدُونَ فِي صُدُورِهِمْ حَاجَةً مِّمَّا أُوتُوا وَيُؤْثِرُونَ عَلَىٰ أَنفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ ۚ وَمَن يُوقَ شُحَّ نَفْسِهِ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
      "page_number": 546,
      "juz_number": 28,
      "translations": [
        {
          "id": 100830,
          "resource_id": 20,
          "text": "And [also for] those who were settled in the Home [i.e.,al-Madīnah] and [adopted] the faith before them.<sup foot_note=197527>1</sup> They love those who emigrated to them and find not any want in their breasts of what they [i.e., the emigrants] were given but give [them] preference over themselves, even though they are in privation. And whoever is protected from the stinginess of his soul - it is those who will be the successful."
        },
        {
          "id": 1171731,
          "resource_id": 213,
          "text": "আর তাদের জন্যও, মুহাজিরদের আগমনের আগে যারা এ নগরীকে নিবাস হিসেবে গ্রহণ করেছে ও ঈমান গ্রহণ করেছে, তারা তাদের কাছে যারা হিজরত করে এসেছে তাদের  ভালবাসে এবং মুহাজিরদেরকে যা দেয়া হয়েছে তার জন্য তারা তাদের অন্তরে কোনো (না পাওয়া জনিত) হিংসা অনুভব করে না, আর তারা তাদেরকে নিজেদের উপর অগ্ৰাধিকার দেয় নিজেরা অভাবগ্ৰস্ত হলেও [১]। বস্তুতঃ যাদেরকে অন্তরের কার্পণ্য থেকে মুক্ত রাখা হয়েছে, তারাই সফলকাম [২]।"
        }
      ]
    },
    {
      "id": 5136,
      "verse_number": 10,
      "verse_key": "59:10",
      "hizb_number": 55,
      "rub_el_hizb_number": 218,
      "ruku_number": 481,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "وَٱلَّذِينَ جَآءُو مِنۢ بَعْدِهِمْ يَقُولُونَ رَبَّنَا ٱغْفِرْ لَنَا وَلِإِخْوَٰنِنَا ٱلَّذِينَ سَبَقُونَا بِٱلْإِيمَـٰنِ وَلَا تَجْعَلْ فِى قُلُوبِنَا غِلًّا لِّلَّذِينَ ءَامَنُوا۟ رَبَّنَآ إِنَّكَ رَءُوفٌ رَّحِيمٌ",
      "text_imlaei": "وَالَّذِينَ جَاءُوا مِن بَعْدِهِمْ يَقُولُونَ رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَّحِيمٌ",
      "page_number": 547,
      "juz_number": 28,
      "translations": [
        {
          "id": 100800,
          "resource_id": 20,
          "text": "And [there is a share for] those who come after them, saying, \"Our Lord, forgive us and our brothers who preceded us in faith and put not in our hearts [any] resentment toward those who have believed. Our Lord, indeed You are Kind and Merciful.\""
        },
        {
          "id": 1171732,
          "resource_id": 213,
          "text": "আর যারা তাদের পরে এসেছে [১], তারা বলে, ‘হে আমাদের রব! আমাদেরকে ও ঈমানে অগ্রণী আমাদের ভাইদেরকে ক্ষমা করুন এবং যারা ঈমান এনেছিল তাদের বিরুদ্ধে আমাদের অন্তরে বিদ্বেষ রাখবেন না। হে আমাদের রব! নিশ্চয় আপনি দয়ার্দ্র, পরম দয়ালু।’"
        }
      ]
    },
    {
      "id": 5137,
      "verse_number": 11,
      "verse_key": "59:11",
      "hizb_number": 55,
      "rub_el_hizb_number": 219,
      "ruku_number": 482,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "۞ أَلَمْ تَرَ إِلَى ٱلَّذِينَ نَافَقُوا۟ يَقُولُونَ لِإِخْوَٰنِهِمُ ٱلَّذِينَ كَفَرُوا۟ مِنْ أَهْلِ ٱلْكِتَـٰبِ لَئِنْ أُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَلَا نُطِيعُ فِيكُمْ أَحَدًا أَبَدًا وَإِن قُوتِلْتُمْ لَنَنصُرَنَّكُمْ وَٱللَّهُ يَشْهَدُ إِنَّهُمْ لَكَـٰذِبُونَ",
      "text_imlaei": "أَلَمْ تَرَ إِلَى الَّذِينَ نَافَقُوا يَقُولُونَ لِإِخْوَانِهِمُ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ لَئِنْ أُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَلَا نُطِيعُ فِيكُمْ أَحَدًا أَبَدًا وَإِن قُوتِلْتُمْ لَنَنصُرَنَّكُمْ وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ",
      "page_number": 547,
      "juz_number": 28,
      "translations": [
        {
          "id": 100801,
          "resource_id": 20,
          "text": "Have you not considered those who practice hypocrisy, saying to their brothers [i.e., associates] who have disbelieved among the People of the Scripture, \"If you are expelled, we will surely leave with you, and we will not obey, in regard to you, anyone - ever; and if you are fought, we will surely aid you.\" But Allāh testifies that they are liars."
        },
        {
          "id": 1171733,
          "resource_id": 213,
          "text": "আপনি কি মুনাফিকদেরকে দেখেননি? তারা কিতাবীদের মধ্যে যারা কুফরী করেছে তাদের সেসব ভাইকে বলে, ‘তোমরা যদি বহিস্কৃত হও, আমরা অবশ্যই তোমাদের সাথে দেশত্যাগী হব এবং আমরা তোমাদের ব্যাপারে কখনো কারো কথা মানবো না এবং যদি তোমরা আক্রান্ত হও আমরা অবশ্যই তোমাদেরকে সাহায্য করব।’  আর আল্লাহ সাক্ষ্য দিচ্ছেন যে, নিশ্চয় তারা মিথ্যাবাদী।"
        }
      ]
    },
    {
      "id": 5138,
      "verse_number": 12,
      "verse_key": "59:12",
      "hizb_number": 55,
      "rub_el_hizb_number": 219,
      "ruku_number": 482,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "لَئِنْ أُخْرِجُوا۟ لَا يَخْرُجُونَ مَعَهُمْ وَلَئِن قُوتِلُوا۟ لَا يَنصُرُونَهُمْ وَلَئِن نَّصَرُوهُمْ لَيُوَلُّنَّ ٱلْأَدْبَـٰرَ ثُمَّ لَا يُنصَرُونَ",
      "text_imlaei": "لَئِنْ أُخْرِجُوا لَا يَخْرُجُونَ مَعَهُمْ وَلَئِن قُوتِلُوا لَا يَنصُرُونَهُمْ وَلَئِن نَّصَرُوهُمْ لَيُوَلُّنَّ الْأَدْبَارَ ثُمَّ لَا يُنصَرُونَ",
      "page_number": 547,
      "juz_number": 28,
      "translations": [
        {
          "id": 100802,
          "resource_id": 20,
          "text": "If they are expelled, they will not leave with them, and if they are fought, they will not aid them. And [even] if they should aid them, they will surely turn their backs; then [thereafter] they will not be aided."
        },
        {
          "id": 1171734,
          "resource_id": 213,
          "text": "বস্তুত তারা বহিস্কৃত হলে মুনাফিকরা তাদের সাথে দেশত্যাগ করবে না এবং তারা আক্রান্ত হলে এরা তাদেরকে সাহায্য করবে না এবং এরা সাহায্য করতে আসলেও অবশ্যই পৃষ্ঠপ্রদর্শন করবে; তারপর তারা কোনো সাহায্যই পাবে না।"
        }
      ]
    },
    {
      "id": 5139,
      "verse_number": 13,
      "verse_key": "59:13",
      "hizb_number": 55,
      "rub_el_hizb_number": 219,
      "ruku_number": 482,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "لَأَنتُمْ أَشَدُّ رَهْبَةً فِى صُدُورِهِم مِّنَ ٱللَّهِ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَفْقَهُونَ",
      "text_imlaei": "لَأَنتُمْ أَشَدُّ رَهْبَةً فِي صُدُورِهِم مِّنَ اللَّهِ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَفْقَهُونَ",
      "page_number": 547,
      "juz_number": 28,
      "translations": [
        {
          "id": 100803,
          "resource_id": 20,
          "text": "You [believers] are more fearful within their breasts than Allāh. That is because they are a people who do not understand."
        },
        {
          "id": 1171735,
          "resource_id": 213,
          "text": "প্রকৃতপক্ষে এদের অন্তরে আল্লাহ্‌র  চেয়ে তোমাদের ভয়ই সবচেয়ে বেশী। এটা এজন্যে যে, এরা এক অবুঝ সম্প্রদায়।"
        }
      ]
    },
    {
      "id": 5140,
      "verse_number": 14,
      "verse_key": "59:14",
      "hizb_number": 55,
      "rub_el_hizb_number": 219,
      "ruku_number": 482,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "لَا يُقَـٰتِلُونَكُمْ جَمِيعًا إِلَّا فِى قُرًى مُّحَصَّنَةٍ أَوْ مِن وَرَآءِ جُدُرٍۭ ۚ بَأْسُهُم بَيْنَهُمْ شَدِيدٌ ۚ تَحْسَبُهُمْ جَمِيعًا وَقُلُوبُهُمْ شَتَّىٰ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَعْقِلُونَ",
      "text_imlaei": "لَا يُقَاتِلُونَكُمْ جَمِيعًا إِلَّا فِي قُرًى مُّحَصَّنَةٍ أَوْ مِن وَرَاءِ جُدُرٍ ۚ بَأْسُهُم بَيْنَهُمْ شَدِيدٌ ۚ تَحْسَبُهُمْ جَمِيعًا وَقُلُوبُهُمْ شَتَّىٰ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَعْقِلُونَ",
      "page_number": 547,
      "juz_number": 28,
      "translations": [
        {
          "id": 100804,
          "resource_id": 20,
          "text": "They will not fight you all except within fortified cities or from behind walls. Their violence [i.e., enmity] among themselves is severe. You think they are together, but their hearts are diverse. That is because they are a people who do not reason."
        },
        {
          "id": 1171736,
          "resource_id": 213,
          "text": "এরা সবাই সংঘবদ্ধভাবেও তোমাদের বিরুদ্ধে যুদ্ধ করতে সমর্থ হবে না, কিন্তু শুধু সুরক্ষিত জনপদের ভিতরে অথবা দূর্গ-প্রাচীরের আড়ালে থেকে; পরস্পরের মধ্যে তাদের যুদ্ধ প্ৰচণ্ড। আপনি মনে করেন তারা ঐক্যবদ্ধ, কিন্তু তাদের মনের মিল নেই; এটা এজন্যে যে, এরা এক নির্বোধ সম্প্রদায়।"
        }
      ]
    },
    {
      "id": 5141,
      "verse_number": 15,
      "verse_key": "59:15",
      "hizb_number": 55,
      "rub_el_hizb_number": 219,
      "ruku_number": 482,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "كَمَثَلِ ٱلَّذِينَ مِن قَبْلِهِمْ قَرِيبًا ۖ ذَاقُوا۟ وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
      "text_imlaei": "كَمَثَلِ الَّذِينَ مِن قَبْلِهِمْ قَرِيبًا ۖ ذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
      "page_number": 547,
      "juz_number": 28,
      "translations": [
        {
          "id": 100805,
          "resource_id": 20,
          "text": "[Theirs is] like the example of those shortly before them: they tasted the bad consequence of their affair, and they will have a painful punishment."
        },
        {
          "id": 1171737,
          "resource_id": 213,
          "text": "এরা সে লোকদের মত, যারা এদের অব্যবহিত পূর্বে নিজেদের কৃতকর্মের শাস্তি ভোগ করেছে [১], আর তাদের জন্য রয়েছে যন্ত্রণাদায়ক শাস্তি।"
        }
      ]
    },
    {
      "id": 5142,
      "verse_number": 16,
      "verse_key": "59:16",
      "hizb_number": 55,
      "rub_el_hizb_number": 219,
      "ruku_number": 482,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "كَمَثَلِ ٱلشَّيْطَـٰنِ إِذْ قَالَ لِلْإِنسَـٰنِ ٱكْفُرْ فَلَمَّا كَفَرَ قَالَ إِنِّى بَرِىٓءٌ مِّنكَ إِنِّىٓ أَخَافُ ٱللَّهَ رَبَّ ٱلْعَـٰلَمِينَ",
      "text_imlaei": "كَمَثَلِ الشَّيْطَانِ إِذْ قَالَ لِلْإِنسَانِ اكْفُرْ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيءٌ مِّنكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ",
      "page_number": 547,
      "juz_number": 28,
      "translations": [
        {
          "id": 100806,
          "resource_id": 20,
          "text": "[The hypocrites are] like the example of Satan when he says to man, \"Disbelieve.\" But when he disbelieves, he says, \"Indeed, I am disassociated from you. Indeed, I fear Allāh, Lord of the worlds.\""
        },
        {
          "id": 1171738,
          "resource_id": 213,
          "text": "এরা শয়তানের মত, সে মানুষকে বলে, ‘কুফরী কর’; তারপর যখন সে কুফরী করে তখন সে বলে, ‘তোমার সাথে আমার কোনো সম্পর্ক নেই, নিশ্চয় আমি সৃষ্টিকুলের রব আল্লাহকে ভয় করি।’"
        }
      ]
    },
    {
      "id": 5143,
      "verse_number": 17,
      "verse_key": "59:17",
      "hizb_number": 55,
      "rub_el_hizb_number": 219,
      "ruku_number": 482,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "فَكَانَ عَـٰقِبَتَهُمَآ أَنَّهُمَا فِى ٱلنَّارِ خَـٰلِدَيْنِ فِيهَا ۚ وَذَٰلِكَ جَزَٰٓؤُا۟ ٱلظَّـٰلِمِينَ",
      "text_imlaei": "فَكَانَ عَاقِبَتَهُمَا أَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيهَا ۚ وَذَٰلِكَ جَزَاءُ الظَّالِمِينَ",
      "page_number": 548,
      "juz_number": 28,
      "translations": [
        {
          "id": 100743,
          "resource_id": 20,
          "text": "So the outcome for both of them is that they will be in the Fire, abiding eternally therein. And that is the recompense of the wrongdoers."
        },
        {
          "id": 1171739,
          "resource_id": 213,
          "text": "ফলে তাদের দু'জনের পরিণাম এই যে, তারা দু’জনই জাহান্নামী হবে। সেখানে তারা স্থায়ী হবে এবং এটাই যালিমদের প্রতিদান।"
        }
      ]
    },
    {
      "id": 5144,
      "verse_number": 18,
      "verse_key": "59:18",
      "hizb_number": 55,
      "rub_el_hizb_number": 219,
      "ruku_number": 483,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ وَلْتَنظُرْ نَفْسٌ مَّا قَدَّمَتْ لِغَدٍ ۖ وَٱتَّقُوا۟ ٱللَّهَ ۚ إِنَّ ٱللَّهَ خَبِيرٌۢ بِمَا تَعْمَلُونَ",
      "text_imlaei": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَلْتَنظُرْ نَفْسٌ مَّا قَدَّمَتْ لِغَدٍ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ",
      "page_number": 548,
      "juz_number": 28,
      "translations": [
        {
          "id": 100808,
          "resource_id": 20,
          "text": "O you who have believed, fear Allāh. And let every soul look to what it has put forth for tomorrow - and fear Allāh. Indeed, Allāh is Aware of what you do."
        },
        {
          "id": 1171740,
          "resource_id": 213,
          "text": "হে ঈমানদারগণ! তোমরা আল্লাহর তাকওয়া অবলম্বন কর এবং প্ৰত্যেকের উচিত চিন্তা করে দেখা আগামী কালের জন্য সে কী অগ্রিম পাঠিয়েছে [১]। আর তোমরা আল্লাহর তাকওয়া অবলম্বন কর; তোমরা যা কর নিশ্চয় আল্লাহ সে সম্পর্কে সবিশেষ অবহিত।"
        }
      ]
    },
    {
      "id": 5145,
      "verse_number": 19,
      "verse_key": "59:19",
      "hizb_number": 55,
      "rub_el_hizb_number": 219,
      "ruku_number": 483,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "وَلَا تَكُونُوا۟ كَٱلَّذِينَ نَسُوا۟ ٱللَّهَ فَأَنسَىٰهُمْ أَنفُسَهُمْ ۚ أُو۟لَـٰٓئِكَ هُمُ ٱلْفَـٰسِقُونَ",
      "text_imlaei": "وَلَا تَكُونُوا كَالَّذِينَ نَسُوا اللَّهَ فَأَنسَاهُمْ أَنفُسَهُمْ ۚ أُولَٰئِكَ هُمُ الْفَاسِقُونَ",
      "page_number": 548,
      "juz_number": 28,
      "translations": [
        {
          "id": 100809,
          "resource_id": 20,
          "text": "And be not like those who forgot Allāh, so He made them forget themselves. Those are the defiantly disobedient."
        },
        {
          "id": 1171741,
          "resource_id": 213,
          "text": "আর তোমরা তাদের মত হয়ো না যারা আল্লাহকে ভুলে গেছে; ফলে আল্লাহ তাদেরকে  আত্নবিস্মৃত করেছেন। তারাইতো ফাসিক।"
        }
      ]
    },
    {
      "id": 5146,
      "verse_number": 20,
      "verse_key": "59:20",
      "hizb_number": 55,
      "rub_el_hizb_number": 219,
      "ruku_number": 483,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "لَا يَسْتَوِىٓ أَصْحَـٰبُ ٱلنَّارِ وَأَصْحَـٰبُ ٱلْجَنَّةِ ۚ أَصْحَـٰبُ ٱلْجَنَّةِ هُمُ ٱلْفَآئِزُونَ",
      "text_imlaei": "لَا يَسْتَوِي أَصْحَابُ النَّارِ وَأَصْحَابُ الْجَنَّةِ ۚ أَصْحَابُ الْجَنَّةِ هُمُ الْفَائِزُونَ",
      "page_number": 548,
      "juz_number": 28,
      "translations": [
        {
          "id": 100812,
          "resource_id": 20,
          "text": "Not equal are the companions of the Fire and the companions of Paradise. The companions of Paradise - they are the attainers [of success]."
        },
        {
          "id": 1171742,
          "resource_id": 213,
          "text": "জাহান্নামের অধিবাসী এবং জান্নাতের অধিবাসী সমান নয়। জান্নাতবাসীরাই তো সফলকাম।"
        }
      ]
    },
    {
      "id": 5147,
      "verse_number": 21,
      "verse_key": "59:21",
      "hizb_number": 55,
      "rub_el_hizb_number": 219,
      "ruku_number": 483,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "لَوْ أَنزَلْنَا هَـٰذَا ٱلْقُرْءَانَ عَلَىٰ جَبَلٍ لَّرَأَيْتَهُۥ خَـٰشِعًا مُّتَصَدِّعًا مِّنْ خَشْيَةِ ٱللَّهِ ۚ وَتِلْكَ ٱلْأَمْثَـٰلُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ",
      "text_imlaei": "لَوْ أَنزَلْنَا هَٰذَا الْقُرْآنَ عَلَىٰ جَبَلٍ لَّرَأَيْتَهُ خَاشِعًا مُّتَصَدِّعًا مِّنْ خَشْيَةِ اللَّهِ ۚ وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ",
      "page_number": 548,
      "juz_number": 28,
      "translations": [
        {
          "id": 100813,
          "resource_id": 20,
          "text": "If We had sent down this Qur’ān upon a mountain, you would have seen it humbled and splitting from fear of Allāh. And these examples We present to the people that perhaps they will give thought."
        },
        {
          "id": 1171743,
          "resource_id": 213,
          "text": "যদি আমরা এ কুরআন পর্বতের উপর নাযিল করতাম তবে আপনি তাকে আল্লাহর ভয়ে বিনীত বিদীর্ণ দেখতেন। আর আমরা এসব দৃষ্টান্ত বর্ণনা করি মানুষের জন্য, যাতে তারা চিন্তা করে।"
        }
      ]
    },
    {
      "id": 5148,
      "verse_number": 22,
      "verse_key": "59:22",
      "hizb_number": 55,
      "rub_el_hizb_number": 219,
      "ruku_number": 483,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "هُوَ ٱللَّهُ ٱلَّذِى لَآ إِلَـٰهَ إِلَّا هُوَ ۖ عَـٰلِمُ ٱلْغَيْبِ وَٱلشَّهَـٰدَةِ ۖ هُوَ ٱلرَّحْمَـٰنُ ٱلرَّحِيمُ",
      "text_imlaei": "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ ۖ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ ۖ هُوَ الرَّحْمَٰنُ الرَّحِيمُ",
      "page_number": 548,
      "juz_number": 28,
      "translations": [
        {
          "id": 100814,
          "resource_id": 20,
          "text": "He is Allāh, other than whom there is no deity, Knower of the unseen and the witnessed.<sup foot_note=197528>1</sup> He is the Entirely Merciful, the Especially Merciful."
        },
        {
          "id": 1171744,
          "resource_id": 213,
          "text": "তিনিই আল্লাহ, তিনি ছাড়া কোনো সত্য ইলাহ নেই, তিনি গায়েব ও উপস্থিত বিষয়াদির জ্ঞানী [১]; তিনি দয়াময়, পরম দয়ালু [২]।"
        }
      ]
    },
    {
      "id": 5149,
      "verse_number": 23,
      "verse_key": "59:23",
      "hizb_number": 55,
      "rub_el_hizb_number": 219,
      "ruku_number": 483,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "هُوَ ٱللَّهُ ٱلَّذِى لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْمَلِكُ ٱلْقُدُّوسُ ٱلسَّلَـٰمُ ٱلْمُؤْمِنُ ٱلْمُهَيْمِنُ ٱلْعَزِيزُ ٱلْجَبَّارُ ٱلْمُتَكَبِّرُ ۚ سُبْحَـٰنَ ٱللَّهِ عَمَّا يُشْرِكُونَ",
      "text_imlaei": "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ ۚ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ",
      "page_number": 548,
      "juz_number": 28,
      "translations": [
        {
          "id": 100815,
          "resource_id": 20,
          "text": "He is Allāh, other than whom there is no deity, the Sovereign,<sup foot_note=197536>1</sup> the Pure,<sup foot_note=197535>2</sup> the Perfection,<sup foot_note=197534>3</sup> the Grantor of Security,<sup foot_note=197533>4</sup> the Overseer,<sup foot_note=197532>5</sup> the Exalted in Might,<sup foot_note=197531>6</sup> the Compeller,<sup foot_note=197530>7</sup> the Superior.<sup foot_note=197529>8</sup> Exalted is Allāh above whatever they associate with Him."
        },
        {
          "id": 1171745,
          "resource_id": 213,
          "text": "তিনি আল্লাহ্‌, তিনি ছাড়া কোনো সত্য ইলাহ নেই। তিনিই অধিপতি, মহাপবিত্র [১], ক্রটিমুক্ত, নিরাপত্তা বিধায়ক, রক্ষক, পরাক্রমশালী, প্রবল, অতীব মহিমান্বিত। তারা যা শরীক স্থির করে আল্লাহ্‌ তা হতে পবিত্র, মহান।"
        }
      ]
    },
    {
      "id": 5150,
      "verse_number": 24,
      "verse_key": "59:24",
      "hizb_number": 55,
      "rub_el_hizb_number": 219,
      "ruku_number": 483,
      "manzil_number": 7,
      "sajdah_number": null,
      "text_uthmani": "هُوَ ٱللَّهُ ٱلْخَـٰلِقُ ٱلْبَارِئُ ٱلْمُصَوِّرُ ۖ لَهُ ٱلْأَسْمَآءُ ٱلْحُسْنَىٰ ۚ يُسَبِّحُ لَهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۖ وَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
      "text_imlaei": "هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ ۖ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "page_number": 548,
      "juz_number": 28,
      "translations": [
        {
          "id": 100816,
          "resource_id": 20,
          "text": "He is Allāh, the Creator,<sup foot_note=197541>1</sup> the Producer,<sup foot_note=197540>2</sup> the Fashioner;<sup foot_note=197539>3</sup> to Him belong the best names.<sup foot_note=197538>4</sup> Whatever is in the heavens and earth is exalting Him. And He is the Exalted in Might, the Wise.<sup foot_note=197537>5</sup>"
        },
        {
          "id": 1171746,
          "resource_id": 213,
          "text": "তিনিই আল্লাহ সৃজনকর্তা, উদ্ভাবন কর্তা, তাঁরই সকল উত্তম নাম [১]। আসমানসমূহ ও যমীনে যা কিছু আছে, সবকিছুই  তাঁর পবিত্রতা ও মহিমা ঘোষণা করে। তিনি পরক্রমশালী, প্রজ্ঞাময়।"
        }
      ]
    }
  ],
  "audio_metadata": {
    "audio_file": {
      "id": 1027,
      "chapter_id": 59,
      "file_size": 10033280.0,
      "format": "mp3",
      "audio_url": "https://download.quranicaudio.com/qdc/mishari_al_afasy/murattal/59.mp3"
    }
  }
}